In [1]:
import psycopg2
from sqlalchemy import create_engine

In [7]:
def get_engine(user, password, host, port, database):
    """
    Returns an engine to the database
    """
    return create_engine('postgresql://{}:{}@{}:{}/{}'.format(user, password, host, port, database))

engine = get_engine(user=input('Enter your username: '), 
                    password=input("enter password: "), 
                    host='localhost', 
                    port=5432, 
                    database=input("Enter database name: "))
print(engine)

Engine(postgresql://rob_the_programmer:***@localhost:5432/employeedata)

In [16]:
# function that lists the tables in the database
def list_tables(engine):
    """
    Lists the tables in the database
    """
    conn = engine.connect()
    result = conn.execute("""SELECT table_name 
                            FROM information_schema.tables 
                            WHERE table_schema='public'""")
    for row in result:
        print(row)
    return result

In [17]:
list_tables(engine)

('employees',)
('dates',)

In [18]:
import pandas as pd # as a dataframe, the results are easier to read

In [20]:
query = """SELECT * FROM employees;"""
employees = pd.read_sql_query(query, engine)
employees.head()

,employeekey,salesterritorykey,firstname,lastname,middlename,namestyle,title,hiredate,birthdate,loginid,...,payfrequency,baserate,vacationhours,sickleavehours,currentflag,salespersonflag,departmentname,startdate,enddate,status
0,1,11,Guy,Gilbert,R,0,Production Technician - WC60,2006-01-28,1981-11-12,adventure-works\guy1,...,1,12.4500,21,30,1,0,Production,2006-01-28,None,Current
1,2,11,Kevin,Brown,F,0,Marketing Assistant,2006-08-26,1986-12-01,adventure-works\kevin0,...,2,13.4615,42,41,1,0,Marketing,2006-08-26,None,Current
2,3,11,Roberto,Tamburello,None,0,Engineering Manager,2007-06-11,1974-06-12,adventure-works\roberto0,...,2,43.2692,2,21,1,0,Engineering,2007-06-11,None,Current
3,4,11,Rob,Walters,None,0,Senior Tool Designer,2007-07-05,1974-07-23,adventure-works\rob0,...,2,29.8462,48,80,1,0,Tool Design,2007-07-05,2009-12-28,None
4,5,11,Rob,Walters,None,0,Senior Tool Designer,2007-07-05,1974-07-23,adventure-works\rob0,...,2,29.8462,48,80,1,0,Tool Design,2009-12-28,None,Current

In [22]:
len(employees)

296

In [21]:
query = """select * from dates;"""
dates = pd.read_sql_query(query, engine)
dates.head()

,datekey,fulldatealternatekey,daynumberofweek,englishdaynameofweek,spanishdaynameofweek,frenchdaynameofweek,daynumberofmonth,daynumberofyear,weeknumberofyear,englishmonthname,spanishmonthname,frenchmonthname,monthnumberofyear,calendarquarter,calendaryear,calendarsemester,fiscalquarter,fiscalyear,fiscalsemester
0,20050101,2005-01-01,7,Saturday,Sábado,Samedi,1,1,1,January,Enero,Janvier,1,1,2005,1,3,2005,2
1,20050102,2005-01-02,1,Sunday,Domingo,Dimanche,2,2,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
2,20050103,2005-01-03,2,Monday,Lunes,Lundi,3,3,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
3,20050104,2005-01-04,3,Tuesday,Martes,Mardi,4,4,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
4,20050105,2005-01-05,4,Wednesday,Miércoles,Mercredi,5,5,2,January,Enero,Janvier,1,1,2005,1,3,2005,2

In [23]:
len(dates)

3652

In [25]:
engine.execute("""select 
                min(employees.startdate), 
                max(employees.startdate)
            from employees;""").fetchall()

[(datetime.date(2006, 1, 28), datetime.date(2013, 6, 13))]

In [39]:
# check how many people have started per month and year
started_per_month = pd.read_sql_query("""
                select
                    count(employees.startdate),
                    extract(year from employees.startdate) as year,
                    extract(month from employees.startdate) as month
                from employees
                group by 3, 2
                order by 2, 3;
                """, engine)

started_per_month.head(20)

    count    year  month
0       1  2006.0    1.0
1       1  2006.0    8.0
2       1  2007.0    6.0
3       4  2007.0    7.0
4       5  2007.0    8.0
5       4  2007.0    9.0
6       3  2007.0   10.0
7      62  2008.0    7.0
8      61  2008.0    8.0
9      61  2008.0    9.0
10     13  2008.0   10.0
11      1  2008.0   12.0
12      1  2009.0    2.0
13     12  2009.0    7.0
14     15  2009.0    8.0
15     12  2009.0    9.0
16      6  2009.0   10.0
17      1  2009.0   12.0
18      5  2010.0    7.0
19      3  2010.0    8.0

In [45]:
# active on given date
active_on_date = pd.read_sql_query("""
                select count(1)
                from employees
                where employees.startdate >= '2008-07-01'
                and (
                    employees.enddate <= '2008-07-01'
                    or employees.enddate is null
                );
                """
                , engine)

active_on_date

   count
0    273